{
  "latest_updated": "Jan 26, 2026",
  "changelogs": [
    {
      "date": "Anniversary Update (Dec 2025/Jan 2026)",
      "changes": [
        "Removed 'Heading' element and moved it to the text editor (Any existing heading element will be converted to text).",
        "Added new flag-style icons for assets and the flag wrapper (same icons as on osu! web)",
        "Added Define Costum Font Size feature (from 50 to 200)",
        "Added BBCode Output Compression feature",
        "Added emoji picker to the text editor",
        "Added new tools to the text editor (YouTube, Profile, Assets, Lists)",
        "Added functionality to rearrange canvas element menu buttons",
        "Added preference option for auto-hide canvas menu",
        "Added canvas auto-sync with the user's latest me! page",
        "Added font style to the text editor",
        "Added support for gradients in links",
        "Fixed link form not showing when selecting a link",
        "Fixed auto-save feature not working on mobile",
        "Fixed text selection reset when clicking outside the text editor area",
        "Fixed redundant generated links when a gradient is applied",
        "Fixed Unicode (fancy text) incorrectly rendered when applied with gradients",
        "Implemented the 'Clone from osu!' feature",
        "Improved Image Map Editor (better resize handles, a new auto-snap feature, and a sticky 'Add Item' button",
        "Improved Gradients (for a smoother transition from start to finish)"
      ]
    },
    {
      "date": "May 2025",
      "changes": [
        "Added support to use Google Drive link in audio editor",
        "Added support for custom colors in links",
        "Added hotkeys for canvas actions",
        "Added 2 new project templates",
        "Added Element Group (to group canvas items)",
        "Added new option to display the flag wrapper vertically",
        "Bug fixes and code adjustments"
      ]
    },
    {
      "date": "Apr 2025",
      "changes": ["Bug fixes and code adjustments"]
    },
    {
      "date": "Feb 2025",
      "changes": ["Bug fixes and code adjustments"]
    },
    {
      "date": "Jan 2025",
      "changes": [
        "Added option to hide canvas content while moving",
        "Added support for moving selected canvas items",
        "Added Undo/Redo functionality on Canvas",
        "Added support for importing Image Maps from BBCode",
        "Added Element Flags (for generating user links with flags)",
        "Added 5 new project templates",
        "Restored scroll position when returning to edit mode",
        "Hid Canvas Element List while dragging a Canvas Item",
        "Introduced new gradient types: Middle, Three-Channel, Rainbow, Random",
        "Bug fixes and code adjustments"
      ]
    }
  ]
}
